MVCApp - RavenDB/UnitTestMSMQ/MVCApp - WCF/UnitTestHandlers/Service References/ServiceReference1/PayService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://nservicebus.com" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="PayService" targetNamespace="http://nservicebus.com" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://nservicebus.com" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" />
      <xs:import namespace="http://schemas.datacontract.org/2004/07/Messages" />
      <xs:element name="Process">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" minOccurs="0" name="request" nillable="true" type="q1:PayMessage" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="ProcessResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q2="http://schemas.datacontract.org/2004/07/Messages" minOccurs="0" name="ProcessResult" type="q2:ErrorCodes" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:tns="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
      <xs:import namespace="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts" />
      <xs:complexType name="PayMessage">
        <xs:sequence>
          <xs:element minOccurs="0" name="EventId" type="ser:guid" />
          <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts" minOccurs="0" name="paymentReq" nillable="true" type="q1:PaymentReq" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="PayMessage" nillable="true" type="tns:PayMessage" />
    </xs:schema>
    <xs:schema xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:tns="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
      <xs:complexType name="PaymentReq">
        <xs:sequence>
          <xs:element minOccurs="0" name="address" nillable="true" type="tns:Address" />
          <xs:element minOccurs="0" name="bankAccountNumber" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="bankRoutingNumber" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="billerGroupId" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="billerId" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="companyName" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="firstName" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="lastName" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="nameOnAccount" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="paymentAmount" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="paymentChannel" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="paymentReferenceId" type="ser:guid" />
          <xs:element minOccurs="0" name="phone" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="PaymentReq" nillable="true" type="tns:PaymentReq" />
      <xs:complexType name="Address">
        <xs:sequence>
          <xs:element minOccurs="0" name="city" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="state" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="streetAddress1" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="streetAddress2" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="zip" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="Address" nillable="true" type="tns:Address" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/Messages" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Messages" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:simpleType name="ErrorCodes">
        <xs:restriction base="xs:string">
          <xs:enumeration value="None" />
          <xs:enumeration value="Fail" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="ErrorCodes" nillable="true" type="tns:ErrorCodes" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="IWcfServiceOf_PayMessage_ErrorCodes_Process_InputMessage">
    <wsdl:part name="parameters" element="tns:Process" />
  </wsdl:message>
  <wsdl:message name="IWcfServiceOf_PayMessage_ErrorCodes_Process_OutputMessage">
    <wsdl:part name="parameters" element="tns:ProcessResponse" />
  </wsdl:message>
  <wsdl:portType name="IWcfServiceOf_PayMessage_ErrorCodes">
    <wsdl:operation name="Process">
      <wsdl:input wsaw:Action="http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process" message="tns:IWcfServiceOf_PayMessage_ErrorCodes_Process_InputMessage" />
      <wsdl:output wsaw:Action="http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/ProcessResponse" message="tns:IWcfServiceOf_PayMessage_ErrorCodes_Process_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IWcfServiceOf_PayMessage_ErrorCodes" type="tns:IWcfServiceOf_PayMessage_ErrorCodes">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="Process">
      <soap:operation soapAction="http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="PayService">
    <wsdl:port name="BasicHttpBinding_IWcfServiceOf_PayMessage_ErrorCodes" binding="tns:BasicHttpBinding_IWcfServiceOf_PayMessage_ErrorCodes">
      <soap:address location="http://localhost:9009/services/paymessage" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>