Payment_WCFService/WCFService/WCFService/bin/Debug/eb0b2c09-159f-4f65-95b6-ae0b5008bb2fTraces.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:42:19.2189466Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{2d31fd1e-00a4-4dd9-be57-07a099bb0a05}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="6" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:42:19.0410554-06:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozJaFKNxYlVOpJD2ejd7yuwAAAAAu78V5o1mIka10AEeaLjRzjUF5pIJPwlIgtVgTZrU+gkACQAA</VsDebuggerCausalityData><SOAPAction>"http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>1140</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:9009</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:9009/services/paymessage</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process</Action></s:Header><s:Body><Process xmlns="http://nservicebus.com"><request xmlns:a="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:EventId>8b265223-dc9e-4789-a6df-69d19f644ad7</a:EventId><a:paymentReq xmlns:b="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts"><b:address><b:city>Denver</b:city><b:state>CO</b:state><b:streetAddress1>Accounting Building</b:streetAddress1><b:streetAddress2>123 Gold Street</b:streetAddress2><b:zip i:nil="true"></b:zip></b:address><b:bankAccountNumber>555555555</b:bankAccountNumber><b:bankRoutingNumber>444444444</b:bankRoutingNumber><b:billerGroupId>ORDER</b:billerGroupId><b:billerId>USER</b:billerId><b:companyName>Money Company</b:companyName><b:firstName>ATTN</b:firstName><b:lastName>BILLING</b:lastName><b:nameOnAccount>John Doe</b:nameOnAccount><b:paymentAmount i:nil="true"></b:paymentAmount><b:paymentChannel i:nil="true"></b:paymentChannel><b:paymentReferenceId>e8e9106b-2d48-44b9-b2e7-49c999846542</b:paymentReferenceId><b:phone>3033333333</b:phone></a:paymentReq></request></Process></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:42:19.2199134Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dff789e5-a8dc-47f5-b012-01637664dd55}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="17" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:42:19.0410554-06:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozFaFKNxYlVOpJD2ejd7yuwAAAAAu78V5o1mIka10AEeaLjRzjUF5pIJPwlIgtVgTZrU+gkACQAA</VsDebuggerCausalityData><SOAPAction>"http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>1140</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:9009</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:9009/services/paymessage</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process</Action></s:Header><s:Body><Process xmlns="http://nservicebus.com"><request xmlns:a="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:EventId>8b265223-dc9e-4789-a6df-69d19f644ad7</a:EventId><a:paymentReq xmlns:b="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts"><b:address><b:city>Denver</b:city><b:state>CO</b:state><b:streetAddress1>Accounting Building</b:streetAddress1><b:streetAddress2>123 Gold Street</b:streetAddress2><b:zip i:nil="true"></b:zip></b:address><b:bankAccountNumber>555555555</b:bankAccountNumber><b:bankRoutingNumber>444444444</b:bankRoutingNumber><b:billerGroupId>ORDER</b:billerGroupId><b:billerId>USER</b:billerId><b:companyName>Money Company</b:companyName><b:firstName>ATTN</b:firstName><b:lastName>BILLING</b:lastName><b:nameOnAccount>John Doe</b:nameOnAccount><b:paymentAmount i:nil="true"></b:paymentAmount><b:paymentChannel i:nil="true"></b:paymentChannel><b:paymentReferenceId>e8e9106b-2d48-44b9-b2e7-49c999846542</b:paymentReferenceId><b:phone>3033333333</b:phone></a:paymentReq></request></Process></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:42:19.2769546Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dff789e5-a8dc-47f5-b012-01637664dd55}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="17" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:42:19.2769546-06:00" Source="ServiceLevelReceiveRequest" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozFaFKNxYlVOpJD2ejd7yuwAAAAAu78V5o1mIka10AEeaLjRzjUF5pIJPwlIgtVgTZrU+gkACQAA</VsDebuggerCausalityData><SOAPAction>"http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>1140</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:9009</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:9009/services/paymessage</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process</Action></s:Header><s:Body><Process xmlns="http://nservicebus.com"><request xmlns:a="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:EventId>8b265223-dc9e-4789-a6df-69d19f644ad7</a:EventId><a:paymentReq xmlns:b="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts"><b:address><b:city>Denver</b:city><b:state>CO</b:state><b:streetAddress1>Accounting Building</b:streetAddress1><b:streetAddress2>123 Gold Street</b:streetAddress2><b:zip i:nil="true"></b:zip></b:address><b:bankAccountNumber>555555555</b:bankAccountNumber><b:bankRoutingNumber>444444444</b:bankRoutingNumber><b:billerGroupId>ORDER</b:billerGroupId><b:billerId>USER</b:billerId><b:companyName>Money Company</b:companyName><b:firstName>ATTN</b:firstName><b:lastName>BILLING</b:lastName><b:nameOnAccount>John Doe</b:nameOnAccount><b:paymentAmount i:nil="true"></b:paymentAmount><b:paymentChannel i:nil="true"></b:paymentChannel><b:paymentReferenceId>e8e9106b-2d48-44b9-b2e7-49c999846542</b:paymentReferenceId><b:phone>3033333333</b:phone></a:paymentReq></request></Process></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:42:19.4799826Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{2d31fd1e-00a4-4dd9-be57-07a099bb0a05}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="6" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:42:19.4751486-06:00" Source="ServiceLevelReceiveRequest" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPozJaFKNxYlVOpJD2ejd7yuwAAAAAu78V5o1mIka10AEeaLjRzjUF5pIJPwlIgtVgTZrU+gkACQAA</VsDebuggerCausalityData><SOAPAction>"http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>1140</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:9009</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:9009/services/paymessage</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/Process</Action></s:Header><s:Body><Process xmlns="http://nservicebus.com"><request xmlns:a="http://schemas.datacontract.org/2004/07/MyMessages.IMessages" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:EventId>8b265223-dc9e-4789-a6df-69d19f644ad7</a:EventId><a:paymentReq xmlns:b="http://schemas.datacontract.org/2004/07/MyMessages.MessageParts"><b:address><b:city>Denver</b:city><b:state>CO</b:state><b:streetAddress1>Accounting Building</b:streetAddress1><b:streetAddress2>123 Gold Street</b:streetAddress2><b:zip i:nil="true"></b:zip></b:address><b:bankAccountNumber>555555555</b:bankAccountNumber><b:bankRoutingNumber>444444444</b:bankRoutingNumber><b:billerGroupId>ORDER</b:billerGroupId><b:billerId>USER</b:billerId><b:companyName>Money Company</b:companyName><b:firstName>ATTN</b:firstName><b:lastName>BILLING</b:lastName><b:nameOnAccount>John Doe</b:nameOnAccount><b:paymentAmount i:nil="true"></b:paymentAmount><b:paymentChannel i:nil="true"></b:paymentChannel><b:paymentReferenceId>e8e9106b-2d48-44b9-b2e7-49c999846542</b:paymentReferenceId><b:phone>3033333333</b:phone></a:paymentReq></request></Process></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:44:04.7046527Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{2d31fd1e-00a4-4dd9-be57-07a099bb0a05}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="22" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:44:04.6821918-06:00" Source="ServiceLevelSendReply" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/ProcessResponse</Action><ActivityId CorrelationId="ce9806a0-aa31-4c9b-8429-efd8ed7fde51" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">2d31fd1e-00a4-4dd9-be57-07a099bb0a05</ActivityId></s:Header><s:Body><ProcessResponse xmlns="http://nservicebus.com"><ProcessResult>None</ProcessResult></ProcessResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:44:04.7730121Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dff789e5-a8dc-47f5-b012-01637664dd55}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="17" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:44:04.7730121-06:00" Source="ServiceLevelSendReply" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/ProcessResponse</Action><ActivityId CorrelationId="157004e2-1bdd-402e-9b70-ca9be0c07ced" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">dff789e5-a8dc-47f5-b012-01637664dd55</ActivityId></s:Header><s:Body><ProcessResponse xmlns="http://nservicebus.com"><ProcessResult>None</ProcessResult></ProcessResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-08-23T01:44:04.9165668Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{dff789e5-a8dc-47f5-b012-01637664dd55}" /><Execution ProcessName="NServiceBus.Host" ProcessID="3424" ThreadID="17" /><Channel/><Computer>WIN-UAUT16GPEQA</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-08-22T19:44:04.9087543-06:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://nservicebus.com/IWcfServiceOf_PayMessage_ErrorCodes/ProcessResponse</Action></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="157004e2-1bdd-402e-9b70-ca9be0c07ced" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">dff789e5-a8dc-47f5-b012-01637664dd55</ActivityId></s:Header><s:Body><ProcessResponse xmlns="http://nservicebus.com"><ProcessResult>None</ProcessResult></ProcessResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/